# CannotCreateMonolithicStairs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateMonolithicStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't make monolithic Stairs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateMonolithicStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateMonolithicStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateMonolithicStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace